In [4]:
import pandas as pd

In [108]:
dict1 ={'Name':['Shree Harsha','SriRam','Ranganath','Rakesh','Abhishek',
                'Ashish','Vinay','Chethan'],
                'Marks':[99,89,99,87,90,83,99,89],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female','Male']
               }

In [110]:
dict1

{'Name': ['Shree Harsha',
  'SriRam',
  'Ranganath',
  'Rakesh',
  'Abhishek',
  'Ashish',
  'Vinay',
  'Chethan'],
 'Marks': [99, 89, 99, 87, 90, 83, 99, 89],
 'Gender': ['Male',
  'Female',
  'Female',
  'Male',
  'Male',
  'Female',
  'Female',
  'Male']}

In [111]:
df = pd.DataFrame(dict1)
df

           Name  Marks  Gender
0  Shree Harsha     99    Male
1        SriRam     89  Female
2     Ranganath     99  Female
3        Rakesh     87    Male
4      Abhishek     90    Male
5        Ashish     83  Female
6         Vinay     99  Female
7       Chethan     89    Male

SHOW TOP 3 DATA

In [112]:
df.head(3)

           Name  Marks  Gender
0  Shree Harsha     99    Male
1        SriRam     89  Female
2     Ranganath     99  Female

SHOW BOTTOM 3 DATA

In [113]:
df.tail(3)

      Name  Marks  Gender
5   Ashish     83  Female
6    Vinay     99  Female
7  Chethan     89    Male

SHAPE OF DATA

In [114]:
df.shape

(8, 3)

DATA DESCRIPTION

In [115]:
df.describe(include = 'all')

                Name      Marks Gender
count              8   8.000000      8
unique             8        NaN      2
top     Shree Harsha        NaN   Male
freq               1        NaN      4
mean             NaN  91.875000    NaN
std              NaN   6.266407    NaN
min              NaN  83.000000    NaN
25%              NaN  88.500000    NaN
50%              NaN  89.500000    NaN
75%              NaN  99.000000    NaN
max              NaN  99.000000    NaN

Information of the Data

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Marks   8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 324.0+ bytes

CHECK FOR NULL VALUES

In [117]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False
7  False  False   False

In [118]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [119]:
df.isnull().sum(axis = 1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
dtype: int64

 UNIQUE VALUES IN GENDER

In [120]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [121]:
df['Gender'].nunique()

2

In [122]:
df['Gender'].value_counts()

Gender
Male      4
Female    4
Name: count, dtype: int64

TOTAL NUMBER OF STUDENTS HAVING SCORE ABOVE 85

In [123]:
df[df['Marks']>90]

           Name  Marks  Gender
0  Shree Harsha     99    Male
2     Ranganath     99  Female
6         Vinay     99  Female

MALES SCORED MORE THAN 90

In [124]:
(df['Marks']>90) & (df['Gender'] == 'Male')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [125]:
df1 =((df['Marks']>90) & (df['Gender'] == 'Male'))

In [126]:
df1.sum()

1

BETWEEN FUNCTION

df[df['Marks'].between(90,100)]

AVERAGE FUNCTION

In [127]:
df['Marks'].mean()

91.875

In [128]:
df['Marks'].min()

83

In [129]:
df['Marks'].max()

99

APPLYING FUNCTIONS

In [130]:
def marks(x):
    return x//2

In [131]:
df['Half Marks']= df['Marks'].apply(marks)

In [132]:
df

           Name  Marks  Gender  Half Marks
0  Shree Harsha     99    Male          49
1        SriRam     89  Female          44
2     Ranganath     99  Female          49
3        Rakesh     87    Male          43
4      Abhishek     90    Male          45
5        Ashish     83  Female          41
6         Vinay     99  Female          49
7       Chethan     89    Male          44

LAMBDA FUNCTION

In [133]:
df['Trippled_Marks'] = df['Marks'].apply(lambda x:x*2)

In [134]:
df

           Name  Marks  Gender  Half Marks  Trippled_Marks
0  Shree Harsha     99    Male          49             198
1        SriRam     89  Female          44             178
2     Ranganath     99  Female          49             198
3        Rakesh     87    Male          43             174
4      Abhishek     90    Male          45             180
5        Ashish     83  Female          41             166
6         Vinay     99  Female          49             198
7       Chethan     89    Male          44             178

In [135]:
df['Name_len']= df['Name'].apply(len)

In [136]:
df

           Name  Marks  Gender  Half Marks  Trippled_Marks  Name_len
0  Shree Harsha     99    Male          49             198        12
1        SriRam     89  Female          44             178         6
2     Ranganath     99  Female          49             198         9
3        Rakesh     87    Male          43             174         6
4      Abhishek     90    Male          45             180         8
5        Ashish     83  Female          41             166         6
6         Vinay     99  Female          49             198         5
7       Chethan     89    Male          44             178         7

MAPPING FUNCTION

In [137]:
df['Gender_map']=df['Gender'].map({'Male': 1,
                         'Female':0})

In [138]:
df

,Name,Marks,Gender,Half Marks,Trippled_Marks,Name_len,Gender_map
0,Shree Harsha,99,Male,49,198,12,1
1,SriRam,89,Female,44,178,6,0
2,Ranganath,99,Female,49,198,9,0
3,Rakesh,87,Male,43,174,6,1
4,Abhishek,90,Male,45,180,8,1
5,Ashish,83,Female,41,166,6,0
6,Vinay,99,Female,49,198,5,0
7,Chethan,89,Male,44,178,7,1

DROPPING THE COLUMNS

In [140]:
df = df.drop('Trippled_Marks',axis = 1)

In [141]:
df

           Name  Marks  Gender  Half Marks  Name_len  Gender_map
0  Shree Harsha     99    Male          49        12           1
1        SriRam     89  Female          44         6           0
2     Ranganath     99  Female          49         9           0
3        Rakesh     87    Male          43         6           1
4      Abhishek     90    Male          45         8           1
5        Ashish     83  Female          41         6           0
6         Vinay     99  Female          49         5           0
7       Chethan     89    Male          44         7           1

In [142]:
df.columns

Index(['Name', 'Marks', 'Gender', 'Half Marks', 'Name_len', 'Gender_map'], dtype='object')

In [143]:
df.index

RangeIndex(start=0, stop=8, step=1)

SORTING

In [145]:
df.sort_values(by =['Marks','Gender'], ascending = False)

           Name  Marks  Gender  Half Marks  Name_len  Gender_map
0  Shree Harsha     99    Male          49        12           1
2     Ranganath     99  Female          49         9           0
6         Vinay     99  Female          49         5           0
4      Abhishek     90    Male          45         8           1
7       Chethan     89    Male          44         7           1
1        SriRam     89  Female          44         6           0
3        Rakesh     87    Male          43         6           1
5        Ashish     83  Female          41         6           0

----------------------------------------------------------END!!!---------------------------------------------------------------------